In [38]:
import pandas as pd

In [39]:
# 1-1
data_1 = {"이름":["메로나", "비비빅", "죠스바"], "가격":[300, 400, 250], "재고":[20, 3, 100]}

In [40]:
# 1-2
data_1DF = pd.DataFrame(data_1)

In [120]:
print(data_1DF.index)
print(data_1DF.columns)
print(data_1DF.values)
print(data_1DF.dtypes)
print(data_1DF.ndim)
print(data_1DF.shape)

Index(['일', '이', '삼', 4], dtype='object')
Index(['이름', '가격', '재고', '총 가격'], dtype='object')
[['메로나' 300 20 0]
 ['비비빅' 400 3 0]
 ['죠스바' 250 100 0]
 ['빵빠래' 550 10 0]]
이름      object
가격      object
재고       int64
총 가격     int64
dtype: object
2
(4, 4)

In [42]:
# 1-3
data_1DF["가격"]

0    300
1    400
2    250
Name: 가격, dtype: int64

In [43]:
# 1-4
data_1DF[["이름", "재고"]]

    이름   재고
0  메로나   20
1  비비빅    3
2  죠스바  100

In [44]:
print(data_1DF.iloc[1])
print(data_1DF.iloc[1],[["가격", "재고"]])

이름    비비빅
가격    400
재고      3
Name: 1, dtype: object
이름    비비빅
가격    400
재고      3
Name: 1, dtype: object [['가격', '재고']]

In [45]:
# 1-6
data_1DF.iloc[::2]

    이름   가격   재고
0  메로나  300   20
2  죠스바  250  100

In [46]:
# 1-7
data_1DF.index = ["일", "이", "삼"]
data_1DF

    이름   가격   재고
일  메로나  300   20
이  비비빅  400    3
삼  죠스바  250  100

In [47]:
# 1-8
data_1DF["총 가격"] = 0
data_1DF

    이름   가격   재고  총 가격
일  메로나  300   20     0
이  비비빅  400    3     0
삼  죠스바  250  100     0

In [58]:
# 1-9
data_1DF.loc[4] = ["빵빠래", 550, 10, 0]
data_1DF

    이름   가격   재고  총 가격
일  메로나  300   20     0
이  비비빅  400    3     0
삼  죠스바  250  100     0
4  빵빠래  550   10     0

In [119]:
# 1-10
data_1DF.iloc[1][2] = 23
data_1DF

C:\Users\hwans\AppData\Local\Temp\ipykernel_33392\1420943852.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_1DF.iloc[1][2] = 23
C:\Users\hwans\AppData\Local\Temp\ipykernel_33392\1420943852.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  data_1DF.iloc[1][2] = 23

    이름   가격   재고  총 가격
일  메로나  300   20     0
이  비비빅  400    3     0
삼  죠스바  250  100     0
4  빵빠래  550   10     0

In [73]:
# 2-1
data2 = { "시가" : [2000, 7500, 15450],
        "고가" : [3050, 2050, 15050],
        "저가" : [2050, 2050, 1980],
        "종가" : [1980, 1980, 14900]
}

In [121]:
# 2-2
data2_DF = pd.DataFrame(data2)
print(data2_DF.index)
print(data2_DF.columns)
print(data2_DF.values)
print(data2_DF.dtypes)
print(data2_DF.ndim)
print(data2_DF.shape)

RangeIndex(start=0, stop=3, step=1)
Index(['시가', '고가', '저가', '종가'], dtype='object')
[[ 2000  3050  2050  1980]
 [ 7500  2050  2050  1980]
 [15450 15050  1980 14900]]
시가    int64
고가    int64
저가    int64
종가    int64
dtype: object
2
(3, 4)

In [79]:
# 2-3
data2_DF.index = ["2024-01-01", "2024-02-01", "2024-03-01"]
data2_DF

               시가     고가    저가     종가
2024-01-01   2000   3050  2050   1980
2024-02-01   7500   2050  2050   1980
2024-03-01  15450  15050  1980  14900

In [92]:
# 2-4
data2_DF.rename({"시가":"Open", "고가" :"High", "저가":"Low", "종가":"Close"}, inplace = True)
data2_DF.columns = ["Open", "High", "Low", "Close"]
data2_DF

             Open   High   Low  Close
2024-01-01   2000   3050  2050   1980
2024-02-01   7500   2050  2050   1980
2024-03-01  15450  15050  1980  14900

In [93]:
# 2-5
data2_DF.iloc[1][["Open", "Close"]]

Open     7500
Close    1980
Name: 2024-02-01, dtype: int64

In [95]:
# 2-6
data2_DF.loc["2024-04-01"] = [3200, 3550, 3000, 2990]
data2_DF

             Open   High   Low  Close
2024-01-01   2000   3050  2050   1980
2024-02-01   7500   2050  2050   1980
2024-03-01  15450  15050  1980  14900
2024-04-01   3200   3550  3000   2990

In [97]:
# 2-7
data2_DF.drop("2024-01-01")

             Open   High   Low  Close
2024-02-01   7500   2050  2050   1980
2024-03-01  15450  15050  1980  14900
2024-04-01   3200   3550  3000   2990

In [106]:
# 2-8
data2_DF.iloc[2][2] = 14000
data2_DF

C:\Users\hwans\AppData\Local\Temp\ipykernel_33392\171775668.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data2_DF.iloc[2][2] = 14000
C:\Users\hwans\AppData\Local\Temp\ipykernel_33392\171775668.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  data2_DF.iloc[2][2] = 14000

             Open   High    Low  Close  Average
2024-01-01   2000   3050   2050   1980        0
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0
Total           0      0      0      0        0

In [102]:
# 2-9
data2_DF["Average"] = 0
data2_DF

             Open   High    Low  Close  Average
2024-01-01   2000   3050   2050   1980        0
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0

In [103]:
# 2-10
data2_DF.loc["Total"] = 0
data2_DF

             Open   High    Low  Close  Average
2024-01-01   2000   3050   2050   1980        0
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0
Total           0      0      0      0        0

In [104]:
# 3-1 데이터
# 3-2 데이터 프레임
# 3-3 시리즈
# 3-4 데이터 프레임
# 3-5 array
# 3-6 Series
# 3-7 Series
# 3-8 DataFrame